In [ ]:
#202037002 신재은

In [1]:
import numpy as np
import pandas as pd

In [6]:
"""
None Pythons missing data
"""
arr1 = np.array([1, None, 3, 4])
print(arr1.dtype)

object

In [7]:
arr1.sum() #int와 None은 덧셈이 안된다

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [9]:
"""
Nan missing Numerical Data
"""
arr = np.array([1, np.nan, 3, 4])
print(arr)

[ 1. nan  3.  4.]

In [10]:
arr.sum()

nan

In [14]:
np.nansum(arr)

8.0

In [15]:
np.nanmin(arr)

1.0

In [16]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [18]:
"""
Detecting null values
"""

# isnull()

ser = pd.Series([1, np.nan, 'hello', None]) #문자열이 섞였기 때문에 object로 인식함
print(ser)

0        1
1      NaN
2    hello
3     None
dtype: object

In [19]:
ser.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [20]:
#notnull
ser.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [25]:
#for a DataFrame, there are more options

df = pd.DataFrame([[1, np.nan, 2],
                 [2, 3, 5],
                 [np.nan, 4, 6]])
print(df)

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [26]:
#dropna() : Null 값을 포함하는 행 or 열을 삭제
df.dropna()

     0    1  2
1  2.0  3.0  5

In [28]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [31]:

df[3] = np.nan
print(df)

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [34]:
# how() : NAN이 모두 있을 때만 삭제하는건 all.
df.dropna(how='all', axis='columns')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [36]:
#thresh() : 삭제되지 않을 행/열의 non-null 값의 최소 개수
df.dropna(axis='rows', thresh=2) #최소 2개의 nan값이 있어야 삭제되지않는 것

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [38]:
#fillna() : Null 값을 다른 값으로 대체
ser = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
ser

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [41]:
ser.fillna(-1) #어떤 값으로 Null를 대체할 건지 ()안에 넣기

a    1.0
b   -1.0
c    2.0
d   -1.0
e    3.0
dtype: float64

In [42]:
#Forward-fill = LOCF, 결측 구간 직전 값으로 대체
ser.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [43]:
#backward-fill = NOCH
ser.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [44]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [47]:
df.fillna(method='ffill', axis='columns')

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [49]:
imp_df = df.fillna(method='ffill').copy()
imp_df = imp_df.fillna(method='bfill').copy()
imp_df

     0    1  2   3
0  1.0  3.0  2 NaN
1  2.0  3.0  5 NaN
2  2.0  4.0  6 NaN